import { Text } from '@mantine/core'

export function Footer() {
	return (
		<>
			<Text size='sm' c='dimmed' ta='center'>
				© 2026 SmartCheck Недвижимость — сервис анализа рисков при покупке и продаже жилья для физических лиц.
			</Text>
			<Text size='xs' c='dimmed' ta='center'>
				Информация, размещённая на данном сайте, носит исключительно общий информационный и справочный характер, не
				является юридической консультацией, заключением специалиста либо индивидуальной рекомендацией, направленной на
				принятие конкретного решения в отношении Вашей ситуации.
			</Text>
		</>
	)
}
